type BREED_DETAILType = {
  [key: string]: { context: string };
};

export const BREED_DETAIL: BREED_DETAILType = {
  풍산개: {
    context:
      '호랑이를 잡는 개라고 불릴 정도로 용맹스러운 풍산개! 사회성도 뛰어나 다른 동물들과도 잘 어울려지낸다',
  },
  토이푸들: {
    context:
      '귀여운 외모만큼이나 사랑스러운 애교까지 장착한 귀요미! 사람을 좋아해 주인에게 찰싹 달라붙어 있는 껌딱지~',
  },
  아프간하운드: {
    context:
      '차분하고 느긋한 성격을 가지고 있는 품위 넘치는 귀족견. 활동량이 많은 품종이라 마음껏 뛰어놀 수 있는 환경이 필요해요',
  },
  말라뮤트: {
    context:
      '왕귀요미 말라뮤트는 느긋하고 태평한 성격으로 가지고 있어 주인에게는 충성스럽고 가족들에게는 친절해요',
  },
  불테리어: {
    context:
      '쫑긋 서있는 귀와 작고 까만 눈이 매력 포인트! 뛰어난 체력과 넘치는 에너지를 자랑하며 애교도 많은 귀요미랍니다',
  },
  골든리트리버: {
    context:
      '왕크니까 왕귀여운 골댕이! 착하고 순하지만 사람을 너무너무 좋아해서 내가 주인이 맞나하는 생각이 들 때도 가아끔 있어요ㅎㅎ',
  },
  저먼셰퍼드: {
    context:
      '삼각형의 귀와 짙은 갈색의 멋진 풍채를 지닌 저먼 셰퍼드! 영리하고 책임감이 강하며 주인에 대한 충성심도 강한 편이에요',
  },
  보더콜리: {
    context:
      '개 지능 테스트에서도 1위를 차지한 똑똑하기로 소문난 보더콜리! 주인에 대한 충성심이 깊고 내려진 명령도 완벽하게 이행할 수 있는 능력을 가지고 있어요',
  },
  도베르만: {
    context:
      '매끄러운 털을 가지고 있으며 탄탄한 근육질 몸매의 도베르만! 용맹하고 충실하며 지능이 높아 경비견으로 아주 적합한 품종이에요',
  },
  진돗개: {
    context:
      '주인에 대한 충성심이 많은 지조를 지키는 선비견 진돗개. 진돗개는 주인에 대한 의리를 절대 배반하지 않는답니다!',
  },
  비글: {
    context:
      '엄청난 활동량을 가지고 있는 비글! 활발하고 성격이 좋지만 산책을 자주 시켜주지 않으면 악마견이라는 별명이 왜 생겼는지 알게될지도 몰라요..',
  },
  시베리안허스키: {
    context:
      '활동적이고 사교적인 성격으로 다른 동물들과도 잘 어울리는 시베리안허스키! 사람을 좋아하고 만인에게 친절하답니다',
  },
  시바: {
    context:
      '쫑긋 선 귀와 말린 꼬리가 굉장히 귀여운 시바견! 하지만 털 빠짐 정도는 상상초월이므로 감당할 수 있는지 꼭 고민해봐야 하며, 성격이 까다로운 편이라 키우기 쉽지 않을지도?',
  },
  코카스패니얼: {
    context:
      '온화하고 태평한 성격으로 매일 꾸준히 운동만 시켜주면 어디서든 문제없이 지내요. 아이들과도 잘 어울릴 수 있는 견종으로 아이가 있는 가정에도 적합하답니다!',
  },
  바셋하운드: {
    context:
      '외모만큼이나 성격도 느긋한 녀석으로, 주인에게 충성심이 강하지만 고집이 세고 귀찮게 하는 걸 싫어해요',
  },
  셔틀랜드쉽독: {
    context:
      '활동량이 많은 견종으로 하루 최소 30분 이상의 산책은 필수! 똑똑하면서도 활발한 성격이지만 소리에 민감하여 잘 짖는 편이므로 아파트에서 키우기는 쉽지 않을지도?',
  },
  웰시코기: {
    context:
      '짧은 다리로 활발하게 뛰어다니는 모습이 귀여운 웰시코기! 활동적이고 호기심이 많으며, 친화력이 높아 어린아이들과도 잘 어울립니다',
  },
  잭러셀테리어: {
    context:
      '장난을 좋아하고 생기발랄한 더할나위없이 사랑스러운 잭러셀테리어! 상당한 활동량을 자랑하기에 산책을 자주 시켜주어야 하는 것은 필수!',
  },
  비숑: {
    context:
      '온화한 성격을 가지고 있고 독립적인 성향이 있어 잠시 집을 비웠을 때도 얌전하고 집을 잘 지키고 의젓해요. 높은 지능을 지니고 있어 훈련이 용이한 편이며 미용을 잘해주면 굉장히 귀엽습니다!',
  },
  미니어쳐슈나우저: {
    context:
      '굉장히 영리하고 명랑해요. 착하고 순한 성격을 가지고 있지만, 혼자 있는 걸 싫어하는 편이라 집을 자주 비우는 사람에게는 적합하지 않을지도?',
  },
  퍼그: {
    context:
      '불만 많아 보이는 외모와는 달리 매우 쾌할하고 영리하며, 인내심이 강해요. 더위에 약하기 때문에 여름철 온도 관리에 각별한 주의가 필요해요!',
  },
  프렌치불독: {
    context:
      '순둥순둥하고 친화력이 좋은 프렌치불독! 훈련하기에도 쉽고 어린아이들과도 잘 어울려 많은 가정견으로 사랑받는답니다',
  },
  파피용: {
    context:
      '크고 아름다운 귀를 가지고 있으며, 몸의 긴 털은 매끄럽고 털빠짐이 적은 편이라 관리하기 쉬워요. 주인의 사랑을 독차지하고 싶어해서 간혹 귀찮을 정도로 응석을 부리기도 해요',
  },
  닥스훈트: {
    context:
      '명랑하고 장난스러운 성격으로 주인도 잘 따르는 밝은 성격이지만 경계심이 강해서 잘 짖는 편이에요. 과식하기 쉬워 항상 운동을 해줘야 비만을 예방할 수 있답니다.',
  },
};
